app/views/calendar/_month.html.erb


<% @meetings = Meeting.all if @meetings == nil %>
---
SELECT "meetings".* FROM "meetings"