app/controllers/meetings_controller.rb

  def index
    if params[:name]
      @meetings = current_user.meetings
    else
      @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."user_id" = $1  [["user_id", 3]]

  def edit
   @meeting = Meeting.find(params[:id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT 1  [["id", 2]]

  def create

    @meeting = current_user.meetings.new(meeting_params)
    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("name", "start_time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "r"], ["start_time", "2016-01-10 18:11:00.000000"], ["user_id", 1], ["created_at", "2016-01-27 18:11:42.478420"], ["updated_at", "2016-01-27 18:11:42.478420"]]

  def update
    respond_to do |format|
      if @meeting.update(meeting_params)
---
UPDATE "meetings" SET "name" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["name", "Birthday"], ["updated_at", "2016-02-13 05:43:13.813569"], ["id", 27]]