app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)


    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Alina"], ["email", "alinkin9696@mail.ru"], ["password", "12111996"], ["created_at", "2016-01-25 14:26:28.809407"], ["updated_at", "2016-01-25 14:26:28.809407"]]